app/views/likes/_like_comments.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."comment_id" = $1  [["comment_id", 1]]
---
<%= object.likes.count %>