app/views/likes/_like_posts.html.erb

<% end %>
<%= object.likes.count %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 5]]