app/views/users/show.html.erb

<h4>My Posts</h4>
<% @user.posts.each do |p|%>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]