app/views/shared/_notifications.html.erb

      <div class="modal-header">
        <h5 class="modal-title" id="noticeModalLabel">Notifications <%= current_user.notifications.count%></h5>
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = $1  [["user_id", 1]]