app/helpers/application_helper.rb

SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["user_id", 1], ["post_id", 3], ["LIMIT", 1]]
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."comment_id" = $2 LIMIT $3  [["user_id", 2], ["comment_id", 1], ["LIMIT", 1]]
---
  def liked?(subject, type)
    result = false
    result = Like.where(user_id: current_user.id, post_id: subject.id).exists? if type == 'post'
    result = Like.where(user_id: current_user.id, comment_id: subject.id).exists? if type == 'comment'

INSERT INTO "notifications" ("notice_id", "notice_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["notice_id", 5], ["notice_type", "like-post"], ["user_id", 1], ["created_at", "2021-10-21 17:17:29.806704"], ["updated_at", "2021-10-21 17:17:29.806704"]]
---
  def new_notification(user, notice_id, notice_type)
    notice = user.notifications.build(notice_id: notice_id, notice_type: notice_type)
    user.notice_seen = false
    user.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def notification_find(notice, type)
    return User.find(notice.notice_id) if type == 'friendRequest'
    return Post.find(notice.notice_id) if type == 'comment'
    return Post.find(notice.notice_id) if type == 'like-post'

    return unless type == 'like-comment'

    comment = Comment.find(notice.notice_id)