app/views/posts/index.html.erb

<% @friends.each do |u|%>
  <% u.posts.each do |p|%>
---
SELECT "posts".* FROM "posts"