app/controllers/comments_controller.rb

  def create
    @comment = current_user.comment.build(comment_params)
    @post = Post.find(params[:comment][:post_id])
    if @comment.save
      @notification = new_notification(@post.user, @post.id, 'comment')
      @notification.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Dratuti"], ["post_id", 5], ["user_id", 2], ["created_at", "2021-10-21 17:47:42.968274"], ["updated_at", "2021-10-21 17:47:42.968274"]]
INSERT INTO "notifications" ("notice_id", "notice_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["notice_id", 5], ["notice_type", "comment"], ["user_id", 1], ["created_at", "2021-10-21 17:47:43.053292"], ["updated_at", "2021-10-21 17:47:43.053292"]]