app/controllers/friendships_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "friendships" ("sent_to_id", "sent_by_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sent_to_id", 2], ["sent_by_id", 1], ["created_at", "2021-10-19 23:08:19.664521"], ["updated_at", "2021-10-19 23:08:19.664521"]]
---
  def create
    return if current_user.id == params[:user_id] # Disallow the ability to send yourself a friend request
    # Disallow the ability to send friend request more than once to same person
    return if friend_request_sent?(User.find(params[:user_id]))
    # Disallow the ability to send friend request to someone who already sent you one
    return if friend_request_recieved?(User.find(params[:user_id]))

    @user = User.find(params[:user_id])
    @friendship = current_user.friend_sent.build(sent_to_id: params[:user_id])
    if @friendship.save

SELECT "friendships".* FROM "friendships" WHERE "friendships"."sent_by_id" = $1 AND "friendships"."sent_to_id" = $2 AND "friendships"."status" = $3 LIMIT $4  [["sent_by_id", 1], ["sent_to_id", 2], ["status", false], ["LIMIT", 1]]
UPDATE "friendships" SET "status" = $1, "updated_at" = $2 WHERE "friendships"."id" = $3  [["status", true], ["updated_at", "2021-10-21 17:20:52.349998"], ["id", 1]]
---
  def accept_friend
    @friendship = Friendship.find_by(sent_by_id: params[:user_id], sent_to_id: current_user.id, status: false)
    return unless @friendship # return if no record is found

    @friendship.status = true
    if @friendship.save