app/controllers/likes_controller.rb

  def create
    type = type_subject?(params)
    notice_type = "like-#{type}"
    @subject = Post.find(params[:post_id]) if type == 'post'
    @subject = Comment.find(params[:comment_id]) if type == 'comment'
    if already_liked?(type)
      dislike(type)
    else
      @like = @subject.likes.build(user_id: current_user.id)
      if @like.save
        flash[:success] = "#{type} liked!"
        @notification = new_notification(@subject.user, @subject.id, notice_type)
        @notification.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["comment_id", 1], ["created_at", "2021-10-21 17:51:19.342000"], ["updated_at", "2021-10-21 17:51:19.342000"]]
INSERT INTO "notifications" ("notice_id", "notice_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["notice_id", 5], ["notice_type", "like-post"], ["user_id", 1], ["created_at", "2021-10-21 17:17:29.806704"], ["updated_at", "2021-10-21 17:17:29.806704"]]
UPDATE "users" SET "updated_at" = $1, "notice_seen" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-10-21 17:17:29.775209"], ["notice_seen", false], ["id", 1]]

  def dislike(type)
    @like = Like.find_by(post_id: params[:post_id]) if type == 'post'
    @like = Like.find_by(comment_id: params[:comment_id]) if type == 'comment'
    @like.destroy
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1 LIMIT $2  [["post_id", 5], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]

  def already_liked?(type)
    result = false
    if type == 'post'
      result = Like.where(user_id: current_user.id, post_id:
      params[:post_id]).exists?
    end
    if type == 'comment'
      result = Like.where(user_id: current_user.id, comment_id:
      params[:comment_id]).exists?
---
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["user_id", 1], ["post_id", 5], ["LIMIT", 1]]