app/controllers/posts_controller.rb

SELECT "friendships".* FROM "friendships" WHERE (status =?, true) AND (sent_by_id =1 OR sent_to_id =1)
---
  def index
    @posts = Post.all
    @friends = Friendship.friends
    @my_friends = Friendship.friends.where('sent_by_id =?', current_user.id).or(Friendship.friends.where('sent_to_id =?', current_user.id))