app/controllers/posts_controller.rb

  def index
    @post = Post.all

    friends = my_friends

    @friends = []
    @friends << User.find(current_user.id)
---
SELECT "posts".* FROM "posts"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Added n otice_seen for user model"], ["user_id", 1], ["created_at", "2021-10-20 16:47:25.277734"], ["updated_at", "2021-10-20 16:47:25.277734"]]

  def my_friends
    my_friends = Friendship.friends.where('sent_by_id =?', current_user.id).or(
      Friendship.friends.where('sent_to_id =?', current_user.id)
    )
    friends = []
    my_friends.each do |f|
---
SELECT "friendships".* FROM "friendships" WHERE (status =?, true) AND (sent_by_id =1 OR sent_to_id =1)