app/controllers/users_controller.rb

  def saw_notification()
    current_user.notice_seen = true
    current_user.save
---
UPDATE "users" SET "updated_at" = $1, "notice_seen" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-10-21 17:24:51.703289"], ["notice_seen", true], ["id", 2]]