app/models/user.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
  def friends_and_own_posts
    myfriends = friends()
    our_posts = []
    myfriends.each do |f|
      f.posts.each do |p|