app/models/user.rb

  def friends
    my_friends = Friendship.friends.where('sent_by_id =?', id)
    friend_ids = []
    my_friends.each do |f|
---
SELECT "friendships".* FROM "friendships" WHERE (status =?, true) AND (sent_by_id =1)

  def friends_and_own_posts
    friends = friends()
    friends << User.find(id)
    our_posts = []
    friends.each do |f|
      f.posts.each do |p|
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]